
/*******************************************************************************
  
  * File name :  ADC_2 / stm32f4xx_it.c  
  
			* Application model : Nucleo_F207 Board  

			* Ver2.0
			* January 10. 2017
			* by Sang-min Kim, Jae-Il Kim  &  Dong-hyuk Cha
 
 ****************************************************************************** */

#include "main.h"
#include "stm32f4xx_it.h"					// ÀÎÅÍ·´Æ® »ç¿ë¿¡ ÇÊ¿äÇÑ Çì´õ ÆÄÀÏ

// -- <4> main.c¿¡¼­ Á¤ÀÇÇÑ AdcHandler º¯¼ö¸¦ ¿ÜºÎÁ¤ÀÇº¯¼ö·Î ¼±¾ð 
extern ADC_HandleTypeDef    AdcHandler;

// -------------------------------------------------------------------------------- //

void SysTick_Handler(void)
{	
		HAL_IncTick();
}

// -------------------------------------------------------------------------------- //

// -- <5> ÀÎÅÍ·´Æ®°¡ ¹ß»ýÇÏ¸é ÀÌ¸¦ Ã³¸®ÇÏ´Â Handler ÇÔ¼ö 
void ADC_IRQHandler(void)
{
  HAL_ADC_IRQHandler(&AdcHandler);
}

// -------------------------------------------------------------------------------- //
