
/*******************************************************************************
  
  * File name :  GPIO_2 / main.c  
  
			* Application model : Nucleo_F429 Board  
  
			* Ver2.0
			* January 23. 2017
			* by Sang-min Kim, Jae-Il Kim  &  Dong-hyuk Cha
 
 ****************************************************************************** */

// -- <1> ÇÁ·Î±×·¥ÀÇ ¼öÇà¿¡ ÇÊ¿äÇÑ Çì´õÆÄÀÏ 
#include "main.h"		
#include "Nucleo_F429.h"		// 	Nucleo_F429 º¸µå »ç¿ëÀ» À§ÇÑ Çì´õ ÆÄÀÏ

// -------------------------------------------------------------------------------- //

int main(void) 
{	
		// -- <2> LED¸¦ On/Off ÇÏ±â À§ÇÑ º¯¼ö  (0x01 = 0000 0001) 
		unsigned char led = 0x01;
		
		// -- <3> MCUÀÇ ÃÊ±âÈ­ ÇÔ¼ö
		HAL_Init(); 	
		// -- <4> system clockÀÇ ÃÊ±âÈ­ ÇÔ¼ö
		SystemClock_Config();	
		// --<5>  ½Ç½Àº¸µåÀÇ Ãâ·Â¿ë LEDÀÇ ÃÊ±âÈ­ ÇÔ¼ö	
		LED_Config();

		// -- <6>  500msec µ¿¾È LED¸¦ ¸ðµÎ OnÇÑ ÈÄ¿¡ Off ÇÏ´Â ÇÔ¼ö
		LED_OnOff(GPIO_PIN_LedAll, 500);
		
		// -- <7> ¹«ÇÑ ·çÇÁ·Î µ¿ÀÛ
		while (1) {
			
				 // -- <8> LED1 -> LED2  -> .. -> LED8 ÀÇ ¼ø¼­·Î ½¬ÇÁÆ®ÇÏ¸ç LED¸¦  On/Off ÇÔ
				do {
						  // -- <8-1> º¯¼ö led¿¡ ÇØ´çÇÏ´Â LED¸¦ ONÇÑ ÈÄ¿¡ ´Ù½Ã OFF ÇÔ
						LED_OnOff(led, 200);
						// -- <8-2> º¯¼ö led¸¦ ¿ÞÂÊÀ¸·Î ½¬ÇÁÆ®½ÃÅ°´Â ºñÆ®¿¬»ê 
						led = led << 1;
						led = led & 0xfe;
				} while (led != 0x80); 				// -- <8-3> led = 0x80 (1000 0000) µÉ ¶§±îÁö µ¿ÀÛ  
									              
				 // -- <9> LED8 -> LED7  -> .. -> LED1 ÀÇ ¼ø¼­·Î ½¬ÇÁÆ® ½ÃÅ°¸ç On/Off ÇÔ
				do {
						 // -- <9-1> º¯¼ö led¿¡ ÇØ´çÇÏ´Â LED¸¦ ONÇÑ ÈÄ¿¡ ´Ù½Ã OFF ÇÔ 
						LED_OnOff(led, 200);
						// -- <9-2>  º¯¼ö led¸¦ ¿À¸¥ÂÊÀ¸·Î ½¬ÇÁÆ®½ÃÅ°´Â ºñÆ®¿¬»ê 			
						led = led >> 1;
						led = led & 0x7f;
				} while (led != 0x01);				// --  <9-3> led = 0x01 (0000 0001) µÉ ¶§±îÁö µ¿ÀÛ 		
		}		
}

// -------------------------------------------------------------------------------- //

